SFE-Brudnerd/ArduinoCore-mbed/boards.txt
##############################################################

nicla_vision.name=Arduino Nicla Vision
nicla_vision.build.core=arduino
nicla_vision.build.crossprefix=arm-none-eabi-
nicla_vision.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

nicla_vision.build.variant=NICLA_VISION
nicla_vision.build.mcu=cortex-m7
nicla_vision.build.fpu=-mfpu=fpv5-d16
nicla_vision.build.float-abi=-mfloat-abi=softfp
nicla_vision.build.extra_flags=
nicla_vision.build.architecture=cortex-m7
nicla_vision.build.board=NICLA_VISION
nicla_vision.build.ldscript=linker_script.ld
nicla_vision.compiler.mbed.arch.define=
nicla_vision.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_vision.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_vision.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_vision.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_vision.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_vision.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_vision.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_vision.vid.0=0x2341
nicla_vision.pid.0=0x025f
nicla_vision.vid.1=0x2341
nicla_vision.pid.1=0x035f
nicla_vision.vid.2=0x2341
nicla_vision.pid.2=0x045f
nicla_vision.vid.3=0x2341
nicla_vision.pid.3=0x055f
nicla_vision.upload_port.0.vid=0x2341
nicla_vision.upload_port.0.pid=0x025f
nicla_vision.upload_port.1.vid=0x2341
nicla_vision.upload_port.1.pid=0x035f
nicla_vision.upload_port.2.vid=0x2341
nicla_vision.upload_port.2.pid=0x045f
nicla_vision.upload_port.3.vid=0x2341
nicla_vision.upload_port.3.pid=0x055f

nicla_vision.upload.tool=dfu-util
nicla_vision.upload.tool.default=dfu-util
nicla_vision.upload.protocol=
nicla_vision.upload.transport=
nicla_vision.upload.vid=0x2341
nicla_vision.upload.pid=0x035f
nicla_vision.upload.address=0x08040000
nicla_vision.upload.interface=0
nicla_vision.upload.use_1200bps_touch=true
nicla_vision.upload.wait_for_upload_port=true
nicla_vision.upload.native_usb=true
nicla_vision.upload.maximum_size=1966080
nicla_vision.upload.maximum_data_size=523624

nicla_vision.debug.tool=gdb
nicla_vision.bootloader.tool=openocd
nicla_vision.bootloader.config=-f target/stm32h7x_dual_bank.cfg
nicla_vision.bootloader.programmer=-f interface/stlink.cfg
nicla_vision.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
nicla_vision.bootloader.file=NICLA_VISION/bootloader.elf

##############################################################

sfe_ninab306_thing_plus.name=SparkFun NINA-B306 Thing Plus
sfe_ninab306_thing_plus.build.core=arduino
sfe_ninab306_thing_plus.build.crossprefix=arm-none-eabi-
sfe_ninab306_thing_plus.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

sfe_ninab306_thing_plus.build.variant=SFE_NINAB306_THING_PLUS
sfe_ninab306_thing_plus.build.mcu=cortex-m4
sfe_ninab306_thing_plus.build.extra_flags=
sfe_ninab306_thing_plus.build.architecture=cortex-m4
sfe_ninab306_thing_plus.build.fpu=-mfpu=fpv4-sp-d16
sfe_ninab306_thing_plus.build.float-abi=-mfloat-abi=softfp
sfe_ninab306_thing_plus.build.board=SFE_NINAB306_THING_PLUS
sfe_ninab306_thing_plus.build.ldscript=linker_script.ld
sfe_ninab306_thing_plus.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
sfe_ninab306_thing_plus.compiler.mbed.defines={build.variant.path}/defines.txt
sfe_ninab306_thing_plus.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
sfe_ninab306_thing_plus.compiler.mbed.cflags={build.variant.path}/cflags.txt
sfe_ninab306_thing_plus.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
sfe_ninab306_thing_plus.compiler.mbed.includes={build.variant.path}/includes.txt
sfe_ninab306_thing_plus.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
sfe_ninab306_thing_plus.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
sfe_ninab306_thing_plus.vid.0=0x1b4f
sfe_ninab306_thing_plus.pid.0=0x0030
sfe_ninab306_thing_plus.vid.1=0x1b4f
sfe_ninab306_thing_plus.pid.1=0x0031
sfe_ninab306_thing_plus.vid.2=0x1b4f
sfe_ninab306_thing_plus.pid.2=0x0032
sfe_ninab306_thing_plus.vid.3=0x1b4f
sfe_ninab306_thing_plus.pid.3=0x0033
sfe_ninab306_thing_plus.upload_port.0.vid=0x1b4f
sfe_ninab306_thing_plus.upload_port.0.pid=0x0030
sfe_ninab306_thing_plus.upload_port.1.vid=0x1b4f
sfe_ninab306_thing_plus.upload_port.1.pid=0x0031
sfe_ninab306_thing_plus.upload_port.2.vid=0x1b4f
sfe_ninab306_thing_plus.upload_port.2.pid=0x0032
sfe_ninab306_thing_plus.upload_port.3.vid=0x1b4f
sfe_ninab306_thing_plus.upload_port.3.pid=0x0033

sfe_ninab306_thing_plus.upload.tool=bossac
sfe_ninab306_thing_plus.upload.tool.default=bossac
sfe_ninab306_thing_plus.upload.protocol=
sfe_ninab306_thing_plus.upload.transport=
sfe_ninab306_thing_plus.upload.use_1200bps_touch=true
sfe_ninab306_thing_plus.upload.wait_for_upload_port=true
sfe_ninab306_thing_plus.upload.native_usb=true
sfe_ninab306_thing_plus.upload.maximum_size=983040
sfe_ninab306_thing_plus.upload.maximum_data_size=262144

sfe_ninab306_thing_plus.bootloader.tool=openocd
sfe_ninab306_thing_plus.bootloader.tool.default=openocd
sfe_ninab306_thing_plus.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
sfe_ninab306_thing_plus.bootloader.config=-f target/nrf52.cfg
sfe_ninab306_thing_plus.bootloader.programmer=-f interface/cmsis-dap.cfg
sfe_ninab306_thing_plus.bootloader.file=nano33ble/bootloader.hex

##############################################################